Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For full Gradle details, see the <<gradle,Gradle build>> section below.
ja_jp: Gradleの詳細については、以下の xref:gradle[Gradleビルドセクション] を参照してください。

source: For full Gradle details, see the xref:gradle[Gradle build] section below.
ja_jp: Gradleの詳細については、以下の xref:gradle[Gradleビルド] のセクションを参照してください。

source: For further demonstration, see the outputs of the <<category-named-handlers-example,Attaching named handlers to a category>> example.
ja_jp: さらに詳しい説明については、<<category-named-handlers-example,Attaching named handlers to a category>> 例の出力を参照してください。

source: For further demonstration, see the outputs of the xref:category-named-handlers-example[Attaching named handlers to a category] example.
ja_jp: さらに詳しい説明としては、 xref:category-named-handlers-example[名前付きハンドラをカテゴリにアタッチ] する例の出力を参照してください。

source: For further information, check out this link:https://quarkus.io/blog/quarkus-native-neo4j-call-tree[blog post] that explores the Quarkus Hibernate ORM quickstart using the techniques explained above.
ja_jp: 詳細については、上記で説明した手法を使用して、Quarkus Hibernate ORM クイックスタートについて検討している https://quarkus.io/blog/quarkus-native-neo4j-call-tree[blog 記事] を参照してください。

source: For guidance on testing Quarkus Security features and ensuring that your Quarkus applications are securely protected, see the xref:security-testing.adoc[Security testing] guide.
ja_jp: Quarkus Security の機能のテストと Quarkus アプリケーションがセキュアに保護されていることを確認するためのガイダンスについては、xref:security-testing.adoc[セキュリティーテスト] ガイドを参照してください。

source: For how-to and tutorial topics, include a prerequisites section just after the abstract. Declaring prerequisites clarifies the starting place for both how-to and tutorial content. Include them even though they might seem obvious to knowledgeable users.
ja_jp: 方法やチュートリアルのトピックの場合は、要約の直後に前提条件のセクションを含めます。 前提条件を宣言すると、方法のコンテンツとチュートリアルコンテンツの両方がどこから始まるのかが明確になります。 知識のあるユーザーにとっては明確なことであって、前提条件は含めてください。

source: For https://quarkus.io/guides/gradle-tooling#building-uber-jars[Gradle]
ja_jp: https://quarkus.io/guides/gradle-tooling#building-uber-jars[Gradle]

source: For https://quarkus.io/guides/maven-tooling#uber-jar-maven[Maven]
ja_jp: https://quarkus.io/guides/maven-tooling#uber-jar-maven[Maven]

source: For indentation to be respected in the Javadoc comment (list items spread on multiple lines or indented source code), the automatic Eclipse formatter must be disabled (the formatter is automatically included in the build), with the markers `// @formatter:off`/`// @formatter:on`. These require separate comments and a mandatory space after the `//` marker.
ja_jp: Javadocコメントでインデントを尊重するためには（複数行に広がるリスト項目やインデントされたソースコード）、Eclipseの自動フォーマッターを無効にする必要があります（フォーマッターはビルドに自動的に含まれます）。マーカーは `// @formatter:off`/`// @formatter:on` .これらは、個別のコメントと、 `//` マーカーの後に必須のスペースが必要です。

source: For information about Authorization Code Flow access token propagation to downstream services, see the xref:security-openid-connect-client-reference.adoc#token-propagation-rest[Token Propagation] section.
ja_jp: 認可コードフローから下流のサービスへのアクセストークンの伝播については、xref:security-openid-connect-client-reference.adoc#token-propagation-rest[トークンの伝播] セクションを参照してください。

source: For information about Authorization Code Flow access token propagation to downstream services, see the xref:security-openid-connect-client-reference.adoc#token-propagation[Token Propagation] section.
ja_jp: 認可コードフローから下流のサービスへのアクセストークンの伝播については、 xref:security-openid-connect-client-reference.adoc#token-propagation[トークンの伝播] のセクションを参照してください。

source: For information about bearer access token propagation to the downstream services, see the xref:security-openid-connect-client-reference.adoc#token-propagation-rest[Token propagation] section of the Quarkus "OpenID Connect (OIDC) and OAuth2 client and filters reference" guide.
ja_jp: ダウンストリームサービスへのベアラーアクセストークンの伝播については、Quarkus の「OpenID Connect (OIDC) および OAuth2 クライアントとフィルターのリファレンス」ガイドの xref:security-openid-connect-client-reference.adoc#token-propagation-rest[トークンの伝播] セクションを参照してください。

source: For information about bearer access token propagation to the downstream services, see the xref:security-openid-connect-client-reference.adoc#token-propagation[Token propagation] section of the Quarkus "OpenID Connect (OIDC) and OAuth2 client and filters reference" guide.
ja_jp: ダウンストリームサービスへのベアラーアクセストークンの伝播については、Quarkus の「OpenID Connect (OIDC) および OAuth2 クライアントとフィルターのリファレンス」ガイドの xref:security-openid-connect-client-reference.adoc#token-propagation[トークンの伝播] セクションを参照してください。

source: For information about how to configure the Redis client, see the xref:redis-reference.adoc[Quarkus Redis extension reference] guide.
ja_jp: Redis クライアントの設定方法については、xref:redis-reference.adoc[Quarkus Redis エクステンションリファレンス] ガイドを参照してください。

source: For information about how to create a good title for each content type, see xref:doc-reference.adoc#titles-and-headings[Titles and headings] on the "Quarkus style and content guidelines" page.
ja_jp: 各コンテンツタイプに適したタイトルの作成方法については、「Quarkusスタイルコンテンツガイドライン」ページの xref:doc-reference.adoc#titles-and-headings[タイトルと見出し] を参照してください。

source: For information about how to create a good title for each content type, see xref:{doc-guides}/doc-reference.adoc#titles-and-headings[Titles and headings] on the "Quarkus style and content guidelines" page.
ja_jp: 各コンテンツタイプに適したタイトルの作成方法については、「Quarkusスタイル・コンテンツガイドライン」ページの xref:{doc-guides}/doc-reference.adoc#titles-and-headings[タイトルと見出し] を参照してください。

source: For information about how to support multiple tenants, see the Quarkus xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy] guide.
ja_jp: マルチテナントをサポートする方法については、Quarkus xref:security-openid-connect-multitenancy.adoc[OpenID Connect マルチテナンシーの使用] ガイドを参照してください。

source: For information about how to support multiple tenants, see xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy].
ja_jp: マルチテナントへの対応方法については、 xref:security-openid-connect-multitenancy.adoc[OpenID Connect (OIDC) マルチテナンシーの使用] ガイドをお読みください。

source: For information about multitenant support, see xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy].
ja_jp: マルチテナント サポートの詳細については、xref:security-openid-connect-multitenancy.adoc [OpenID Connect マルチテナンシーの使用] を参照してください。

source: For information about options to control maximum heap size, young space, and other typical use cases found in the JVM, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement[GraalVM Memory Management] guide. Setting the maximum heap size, either as a percentage or an explicit value, is generally recommended.
ja_jp: 最大ヒープサイズ、ヤングスペース、およびJVMで見られる他の典型的なユースケースを制御するためのオプションは、link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement[GraalVMメモリ管理ガイド] を参照してください。 一般的には、最大ヒープサイズをパーセンテージまたは明示的な値として設定することを推奨します。

source: For information about other methods that you can use to configure the required user credentials, see the xref:security-testing.adoc#configuring-user-information[Configuring User Information] section of the Quarkus "Security Testing" guide.
ja_jp: 必要なユーザー認証情報を設定するために使用できる他の方法については、Quarkus の「セキュリティーテスト」ガイドの xref:security-testing.adoc#configuring-user-information[ユーザー情報の設定] セクションを参照してください。

source: For information about protecting your applications using Bearer Token authorization, see xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications].
ja_jp: Bearer Token 認証を使用してアプリケーションを保護する方法については、xref:security-openid-connect.adoc [OpenID Connect を使用してサービス アプリケーションを保護する] を参照してください。

source: For information about supporting multiple tenants, see xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy].
ja_jp: 複数のテナントをサポートする方法については、xref:security-openid-connect-multitenancy.adoc[OpenID Connect マルチテナンシーの使用] を参照してください。

source: For information about testing your application in dev mode, see the preceding <<bearer-token-tutorial-keycloak-dev-mode>> section.
ja_jp: 開発モードでのアプリケーションのテストの詳細は、前述の<<bearer-token-tutorial-keycloak-dev-mode>> セクションを参照してください。

source: For information about the claim verification, including the `iss` (issuer) claim, see the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-jwt-claim-verification[JSON Web Token claim verification] section. It applies to ID tokens and also to access tokens in a JWT format, if the `web-app` application has requested the access token verification.
ja_jp: `iss` (発行者) クレームを含むクレーム検証の詳細は、xref:security-oidc-bearer-token-authentication.adoc#bearer-token-jwt-claim-verification[JSON Web Token クレーム検証] セクションを参照してください。 これは、ID トークンに適用され、 `web-app` アプリケーションがアクセストークンの検証をリクエストした場合は、JWT 形式のアクセストークンにも適用されます。

source: For information about the claim verification, including the `iss` (issuer) claim, see the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-jwt-claim-verification[JSON Web Token claim verification] section. It applies to ID tokens and to access tokens in JWT format if the `web-app` application has requested access token verification.
ja_jp: `iss` (発行者) クレームを含むクレーム検証の詳細は、xref:security-oidc-bearer-token-authentication.adoc#bearer-token-jwt-claim-verification[JSON Web Token クレーム検証] セクションを参照してください。 これは、ID トークンに適用され、 `web-app` アプリケーションがアクセストークンの検証をリクエストした場合は、JWT 形式のアクセストークンにも適用されます。

source: For information about the custom Quarkus `TokenStateManager` implementation storing tokens in a database, see <<db-token-state-manager>>.
ja_jp: トークンをデータベースに保存するカスタム Quarkus `TokenStateManager` 実装の詳細は、<<db-token-state-manager>> を参照してください。

source: For information about the default `TokenStateManager` storing tokens in an encrypted session cookie, see <<token-state-manager>>.
ja_jp: 暗号化されたセッションクッキーにトークンを保存するデフォルトの `TokenStateManager` の詳細は、<<token-state-manager>> を参照してください。

source: For information about writing integration tests that depend on `Dev Services for Keycloak`, see the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-keycloak-devservices[Dev Services for Keycloak] section of the "OpenID Connect (OIDC) Bearer token authentication" guide.
ja_jp: `Dev Services for Keycloak` に依存するインテグレーションテストの作成に関する詳細は、「OpenID Connect (OIDC) ベアラートークン認証」ガイドの xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-keycloak-devservices[Dev Services for Keycloak] セクションを参照してください。

source: For instance, for Eclipse users, you can add the `<m2e.apt.activation>disabled</m2e.apt.activation>` property in your POM file.
ja_jp: 例えば、Eclipseユーザーの場合は、POMファイルに `<m2e.apt.activation>disabled</m2e.apt.activation>` プロパティを追加することができます。

source: For instance, having the following properties in your `application.properties`:
ja_jp: たとえば、 `application.properties` で以下のプロパティーを設定すると、

source: For instance, having the following property in your `application.properties`:
ja_jp: たとえば、 `application.properties` に次のプロパティーを記述すると:

source: For instance, if you declare a `WriterInterceptor`, it will by default intercept both the servers calls and the client calls, which might not be the desired behavior.
ja_jp: 例えば、 `WriterInterceptor` を宣言した場合、デフォルトではサーバーの呼び出しとクライアントの呼び出しの両方をインターセプトしますが、これは望ましい動作ではないかもしれません。

source: For instance, if you declare a `WriterInterceptor`, it will, by default, intercept both the servers calls and the client calls, which might not be the desired behavior.
ja_jp: たとえば、`WriterInterceptor` を宣言すると、デフォルトではサーバーの呼び出しとクライアントの呼び出しの両方がインターセプトされますが、これは望ましい動作ではない可能性があります。

source: For instance, if you want to disable the `quarkus:build` goal for a specific module:
ja_jp: 例えば、特定のモジュールで `quarkus:build` ゴールを無効にしたい場合は次のようになります。

source: For instance, if you're developing a PostgreSQL-based application, as soon as you have the PostgreSQL JDBC extension in your pom, a container will be started for testing using Testcontainers.
ja_jp: 例えば、PostgreSQLベースのアプリケーションを開発している場合、PostgreSQL JDBC extensionをpomに入れれば、Testcontainersを使ってテスト用のコンテナが開始されます。

source: For instance, if your cluster API endpoint uses a self-signed SSL Certificate you need to explicitly configure the client to trust it. You can achieve this by defining the following property:
ja_jp: たとえば、クラスター API のエンドポイントが自己署名入り SSL 証明書を使用している場合、それを信頼するようにクライアントを明示的に設定する必要があります。これを実現するには、以下のプロパティーを定義します。

source: For instance, in order to make arbitrary changes to a Servlet deployment Undertow has a `ServletExtensionBuildItem`, which is a `MultiBuildItem` that wraps a `ServletExtension` instance. I can return a `ServletExtension` from a recorder in another module, and Undertow will consume it and pass it into the recorder method that starts Undertow.
ja_jp: 例えば、Servletの配置に任意の変更を加えるために、Undertowは `ServletExtensionBuildItem` を持っています。これは `ServletExtension` インスタンスをラップした `MultiBuildItem` です。他のモジュールのレコーダーから `ServletExtension` を返すと、Undertowはそれを使用し、Undertowを起動するレコーダー・メソッドに渡すことができます。

source: For instance, in the following test, the launched application would receive a mocked singleton `CdiBean1`. The implementation `MockedCdiBean1` is provided by the test:
ja_jp: 例えば、次のテストでは、起動されたアプリケーションはモックされたシングルトン `CdiBean1` を受け取ります。実装 `MockedCdiBean1` はテストによって提供されます：

source: For instance, in the following test, the singleton `CdiBean1` will be mocked by `MockedCdiBean1`:
ja_jp: 例えば、次のテストでは、シングルトン `CdiBean1` は `MockedCdiBean1` によってモック化されます:

source: For instance, let's take this method of the `GitHub` class of the GitHub API:
ja_jp: たとえば、GitHub API の `GitHub` クラスのこのメソッドを例に挙げてみましょう。

source: For instance, let's use `io.quarkiverse.authzed:quarkus-authzed-cli:runner:jar:0.2.0` which is a real executable jar that provides a CLI utility for the `quarkus-authzed` extension.
ja_jp: たとえば、 `quarkus-authzed` エクステンション用の CLI ユーティリティーを提供する実際の実行可能 jar である `io.quarkiverse.authzed:quarkus-authzed-cli:runner:jar:0.2.0` を使用してみましょう。

source: For instance, the `/META-INF/grafana/grafana-dashboard-my-simple-prometheus-dashboard.json` configuration file creates a dashboard named `My Simple Prometheus Dashboard`.
ja_jp: 例えば、`/META-INF/grafana/grafana-dashboard-my-simple-prometheus-dashboard.json` 構成ファイルは、`My Simple Prometheus Dashboard` という名前のダッシュボードを作成します。

source: For instance, the query below will fetch `film0` and `film1` concurrently:
ja_jp: 例えば、以下のクエリでは、 `film0` と `film1` を同時に取得します。

source: For instance, to list all the installable plugins starting with the letter `k`, use the following command:
ja_jp: たとえば、 `k` の文字で始まるインストール可能なプラグインをすべてリスト表示するには、次のコマンドを使用します。

source: For instance, to remove the bridge methods from our GitHub API methods, we add the following build step to our extension:
ja_jp: たとえば、GitHub API のメソッドからブリッジメソッドを削除するには、次のようなビルドステップをエクステンションに追加します。

source: For instance, to serve resources from the `static/` directory relative to the current path at http://localhost:8080/static/, you can install the following route:
ja_jp: 例えば、 http://localhost:8080/static/ でカレントパスから相対的に、 `static/` ディレクトリからリソースを提供するには、以下のルートをインストールします：

source: For instance, when setting `quarkus.jaxb.exclude-classes=org.acme.one.Model,org.acme.two.Model,org.acme.somemodel.*`, the following elements are excluded:
ja_jp: たとえば、 `quarkus.jaxb.exclude-classes=org.acme.one.Model,org.acme.two.Model,org.acme.somemodel.*` を設定すると、次の要素が除外されます。

source: For instance, you can declare a blocking route as follows:
ja_jp: たとえば、次のようにブロッキングルートを宣言できます。

source: For instance, you could override the built-in validator enforcing the `@Email` constraint and use `MyEmailValidator` instead with the following class:
ja_jp: たとえば、 `@Email` 制約を強制する組み込みバリデーターをオーバーライドし、代わりに次のクラスで `MyEmailValidator` を使用できます。

source: For instance, you now get metrics for Kafka.
ja_jp: 例えば、Kafka のメトリクスを取得できるようになりました。

source: For instance:
ja_jp: 例えば

source: For instructions on how to implement custom state stores, see https://smallrye.io/smallrye-reactive-messaging/3.22.0/kafka/receiving-kafka-records/#implementing-state-stores[Implementing State Stores].
ja_jp: カスタムステートストアの実装方法については、 https://smallrye.io/smallrye-reactive-messaging/3.22.0/kafka/receiving-kafka-records/#implementing-state-stores[Implementing State Stores]を参照してください。

source: For integration testing against Keycloak, use xref:security-openid-connect-dev-services.adoc[Dev services for Keycloak]. This service initializes a test container, creates a `quarkus` realm, and configures a `quarkus-app` client with the secret `secret`. It also sets up two users: `alice` with `admin` and `user` roles, and `bob` with the `user` role.
ja_jp: Keycloak に対する結合テストの場合は、xref:security-openid-connect-dev-services.adoc[Dev services for Keycloak] を使用します。 このサービスは、テストコンテナーを初期化し、 `quarkus` レルムを作成し、シークレット `secret` を使用して `quarkus-app` クライアントを設定します。 また、 `admin` および `user` ロールを持つ `alice` と、 `user` ロールを持つ `bob` の 2 人のユーザーも設定します。

source: For large prime numbers, the test takes more time.
ja_jp: 大きな素数の場合は、テストに時間がかかります。

source: For last, the `quarkus.http.auth.permission.authenticated` permission is set to tell Quarkus about the paths you want to protect. In this case, all paths are being protected by a policy that ensures that only `authenticated` users are allowed to access. For more details check xref:security-authorization.adoc[Security Authorization Guide].
ja_jp: 最後に、 `quarkus.http.auth.permission.authenticated` パーミッションは、保護したいパスについて Quarkus に伝えるために設定されています。この場合、すべてのパスは、 `認証された` ユーザーのみがアクセスを許可されることを保証するポリシーによって保護されています。詳細は、 xref:security-authorization.adoc[Security Authorization Guide] を確認してください。

source: For last, the `quarkus.http.auth.permission.authenticated` permission is set to tell Quarkus about the paths you want to protect. In this case, all paths are being protected by a policy that ensures that only `authenticated` users are allowed to access. For more details check xref:security-authorize-web-endpoints-reference.adoc[Security Authorization Guide].
ja_jp: 最後に、保護したいパスについてQuarkusに伝えるために、 `quarkus.http.auth.permission.authenticated` パーミッションが設定されています。この場合では、すべてのパスは、 `authenticated` ユーザーだけがアクセスできるようにするポリシーで保護されています。詳細については、 link:security-authorize-web-endpoints-reference.html[セキュリティ認可ガイド] を参照してください。

source: For logs, select the `loki` data source and query for data:
ja_jp: ログの場合は、 `loki` データソースを選択し、データをクエリーします。

source: For manual testing Quarkus provides a convenient config property to disable authorization in dev mode. This property has the exact same effect as the custom `AuthorizationController` shown above, but is only available in dev mode:
ja_jp: 手動テストのために、Quarkusは、開発モードで認証を無効にする便利な設定プロパティを提供します。このプロパティは、上記のカスタム `AuthorizationController` とまったく同じ効果を持ちますが、開発モードでのみ利用可能です。 :

source: For many libraries, native mode support is the primary motivation for creating an extension. See xref:writing-extensions.adoc#native-executable-support[the guide on native executable support] for more discussion about some of the adaptations that might be needed.
ja_jp: 多くのライブラリーにとって、ネイティブモードのサポートはエクステンションを作成する主な動機です。必要になる可能性のあるいくつかの適応の詳細は、xref:writing-extensions.adoc#native-executable-support[ネイティブ実行可能ファイルのサポートに関するガイド] を参照してください。

source: For maven:
ja_jp: Mavenの場合:

source: For maximum scalability, go beyond the reactive core and enable fully reactive programming, using Mutiny. Most projects that support a reactive programming model offer two distinct extensions, a `-reactive` and a plain one. See, for example, https://quarkus.io/extensions/io.quarkiverse.quarkus-elasticsearch/quarkus-elasticsearch/[ElasticSearch] and https://quarkus.io/extensions/io.quarkiverse.quarkus-elasticsearch-reactive/quarkus-elasticsearch-reactive/[ElasticSearch Reactive] extensions.
ja_jp: スケーラビリティーを最大限に高めるには、Mutiny を使用して、リアクティブコアを超えて、完全なリアクティブプログラミングを有効にします。リアクティブプログラミングモデルをサポートするほとんどのプロジェクトでは、 `-reactive` とプレーンなエクステンションの 2 つの異なるエクステンションが提供されています。 たとえば、 https://quarkus.io/extensions/io.quarkiverse.quarkus-elasticsearch/quarkus-elasticsearch/[ElasticSearch] および https://quarkus.io/extensions/io.quarkiverse.quarkus-elasticsearch-reactive/quarkus-elasticsearch-reactive/[ElasticSearch Reactive] エクステンションを参照してください。

source: For minor documentation changes, you can use the AsciiDoc syntax highlighting and preview provided by your IDE.
ja_jp: ちょっとしたドキュメントの変更であれば、IDEが提供するAsciiDocのシンタックスハイライトとプレビューを利用することができます。

source: For more about the why, how and what of Quarkus, check out the Devoxx Belgium presentation where Quarkus 1.0 was released in November 2019.
ja_jp: Quarkus のなぜ、何を、どうやって、の詳細については、2019 年 11 月に Quarkus 1.0 がリリースされた Devoxx Belgium のプレゼンテーションをご覧ください。

source: For more advanced configuration with examples, see <<datasource-reference>>.
ja_jp: より高度な設定とその例については、<<datasource-reference>> を参照してください。

source: For more complex JSON structures that cannot be expressed with configuration properties, use the xref:security-oidc-code-flow-authentication.adoc#oidc-redirect-filters[io.quarkus.oidc.OidcRedirectFilter].
ja_jp: 設定プロパティーでは表現できない、より複雑な JSON 構造については、 xref:security-oidc-code-flow-authentication.adoc#oidc-redirect-filters[io.quarkus.oidc.OidcRedirectFilter] を使用してください。

source: For more complex scenarios, you can define custom networks and service dependencies:
ja_jp: より複雑なシナリオでは、カスタムネットワークとサービスの依存関係を定義できます。

source: For more complex setup involving multiple tenants please see the xref:security-openid-connect-multitenancy.adoc#programmatic-startup[Programmatic OIDC start-up for multitenant application] section of the OpenID Connect Multi-Tenancy guide.
ja_jp: 複数のテナントが関係するより複雑な設定については、OpenID Connect マルチテナンシーガイドの xref:security-openid-connect-multitenancy.adoc#programmatic-startup[マルチテナントアプリケーション用のプログラムによる OIDC の起動] セクションを参照してください。

source: For more complex setup involving multiple tenants, see the xref:security-openid-connect-multitenancy.adoc#programmatic-startup[Programmatic OIDC start-up for multitenant application] section of the OpenID Connect Multi-Tenancy guide.
ja_jp: 複数のテナントが関係するより複雑な設定については、OpenID Connect マルチテナンシーガイドの xref:security-openid-connect-multitenancy.adoc#programmatic-startup[マルチテナントアプリケーション用のプログラムによる OIDC 起動] セクションを参照してください。

source: For more complex types, `List` and `Set` members must have an identifier in the query parameter. For example:
ja_jp: より複雑な型の場合、 `List` および `Set` のメンバーは、クエリパラメーターに識別子を持つ必要があります。例えば、以下のようになります。

source: For more configuration information, see the *Narayana JTA - Transaction manager* section of the Quarkus xref:all-config.adoc[All configuration options] reference.
ja_jp: 設定の詳細については、Quarkus xref:all-config.adoc[全設定オプション] リファレンスの *Narayana JTA - Transaction manager* セクションを参照してください。

source: For more configuration options see <<configuring-pulsar-clients>>.
ja_jp: 設定オプションの詳細は、<<configuring-pulsar-clients>> を参照してください。

source: For more control, using link:{mutiny}[Mutiny] APIs, you can use the `MutinyEmitter` emitter interface:
ja_jp: さらに制御するには、リンク:{mutiny}[Mutiny] APIs を使用して、`MutinyEmitter` エミッターインターフェイスを使用できます。

source: For more detailed information on mass indexer configuration see the link:{hibernate-search-docs-url}#indexing-massindexer-parameters[corresponding section of the Hibernate Search reference documentation].
ja_jp: 一括インデクサーの設定に関する詳細は、 link:{hibernate-search-docs-url}#indexing-massindexer-parameters[Hibernate Search リファレンスドキュメントの対応するセクション] を参照してください。

source: For more details about `@QuarkusTestResource` refer to xref:getting-started-testing.adoc#quarkus-test-resource[this part of the documentation].
ja_jp: `@QuarkusTestResource` の詳細については、 xref:getting-started-testing.adoc#quarkus-test-resource[ドキュメントの当該箇所] を参照してください。

source: For more details about anchored IDs, see the xref:doc-contribute-docs-howto.adoc#anchors-howto[Cross-reference in-file and cross-file content by using anchors] section of the "Contribute to Quarkus documentation" guide.
ja_jp: アンカー ID の詳細は、Quarkus ドキュメントへのコントリビューションガイドの xref:doc-contribute-docs-howto.adoc#anchors-howto[アンカーを使用してファイル内およびファイル間のコンテンツを相互参照する] セクションを参照してください。
